tap "hashicorp/tap"

# Essentials
brew "stow"
brew "git"
brew "shellcheck"
brew "dockutil"

# Terminal
brew "spaceship"
cask "iterm2"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"

# Terminal tools
brew "zsh"
brew "httpie"
brew "jq"
brew "gh"
brew "eza"
brew "bat"
brew "make"
brew "fzf"
brew "git-delta"
brew "tldr"
brew "thefuck"
brew "zoxide"
brew "jnv"

# Docker
cask "docker"
brew "colima"

brew "docker"
brew "docker-compose"
brew "docker-credential-helper"
brew "docker-machine"

# Cloud tools
brew "hashicorp/tap/terraform"
brew "pulumi"
brew "helm"
brew "k9s"
brew "kubectl"
brew "kubectx"

# AWS
brew "awscli"
brew "aws-iam-authenticator"
cask "aws-vpn-client"

# Languages
brew "golang"
brew "node"
brew "nvm"
brew "yarn"
brew "pyenv"
brew "pyenv-virtualenv"

# Development apps
cask "visual-studio-code"
cask "firefox@developer-edition"
cask "google-chrome"
cask "beekeeper-studio"
cask "figma"
cask "postman"
brew "gemini-cli"

# Productivity apps
cask "cron"
cask "notion"
cask "spotify"

# Communication apps
cask "zoom"
cask "slack"
cask "grammarly-desktop"

# Utilities apps
cask "rectangle"
cask "logi-options-plus"
